---
kind: type
id: T:Autodesk.Revit.DB.Analysis.AnalysisDisplayColoredSurfaceSettings
source: html/fce3c08c-0ec4-4a73-6bbd-975f8b754012.htm
---
# Autodesk.Revit.DB.Analysis.AnalysisDisplayColoredSurfaceSettings

Contains colored surface settings for analysis display style element.

## Syntax (C#)
```csharp
public class AnalysisDisplayColoredSurfaceSettings : IDisposable
```